{
  "componentDescription": "",
  "propDescriptions": {
    "anchorEl": {
      "description": "An HTML element, <a href=\"https://popper.js.org/docs/v2/virtual-elements/\">virtualElement</a>, or a function that returns either. It&#39;s used to set the position of the popper. The return value will passed as the reference object of the Popper instance."
    },
    "children": { "description": "Popper render function or node." },
    "component": {
      "description": "The component used for the root node. Either a string to use a HTML element or a component."
    },
    "components": {
      "description": "The components used for each slot inside the Popper. Either a string to use a HTML element or a component."
    },
    "componentsProps": { "description": "The props used for each slot inside the Popper." },
    "container": {
      "description": "An HTML element or function that returns one. The <code>container</code> will have the portal children appended to it.<br>You can also provide a callback, which is called in a React layout effect. This lets you set the container from a ref, and also makes server-side rendering possible.<br>By default, it uses the body of the top-level document object, so it&#39;s simply <code>document.body</code> most of the time."
    },
    "disablePortal": {
      "description": "The <code>children</code> will be under the DOM hierarchy of the parent component."
    },
    "keepMounted": {
      "description": "Always keep the children in the DOM. This prop can be useful in SEO situation or when you want to maximize the responsiveness of the Popper."
    },
    "modifiers": {
      "description": "Popper.js is based on a &quot;plugin-like&quot; architecture, most of its features are fully encapsulated &quot;modifiers&quot;.<br>A modifier is a function that is called each time Popper.js needs to compute the position of the popper. For this reason, modifiers should be very performant to avoid bottlenecks. To learn how to create a modifier, <a href=\"https://popper.js.org/docs/v2/modifiers/\">read the modifiers documentation</a>."
    },
    "open": { "description": "If <code>true</code>, the component is shown." },
    "placement": { "description": "Popper placement." },
    "popperOptions": {
      "description": "Options provided to the <a href=\"https://popper.js.org/docs/v2/constructors/#options\"><code>Popper.js</code></a> instance."
    },
    "popperRef": { "description": "A ref that points to the used popper instance." },
    "slotProps": { "description": "The props used for each slot inside the Popper." },
    "slots": {
      "description": "The components used for each slot inside the Popper. Either a string to use a HTML element or a component."
    },
    "sx": {
      "description": "The system prop that allows defining system overrides as well as additional CSS styles."
    },
    "transition": {
      "description": "Help supporting a react-transition-group/Transition component."
    }
  },
  "classDescriptions": { "root": { "description": "Class name applied to the root element." } }
}
