{
  "componentDescription": "",
  "propDescriptions": {
    "allowSwipeInChildren": "Callback to determine what children of the drawer the user can use to drag open the drawer. Can be a custom function to control the behavior. Set or return true / false to allow / disallow the swipe event.",
    "children": "The content of the component.",
    "disableBackdropTransition": "Disable the backdrop transition. This can improve the FPS on low-end devices.",
    "disableDiscovery": "If <code>true</code>, touching the screen near the edge of the drawer will not slide in the drawer a bit to promote accidental discovery of the swipe gesture.",
    "disableSwipeToOpen": "If <code>true</code>, swipe to open is disabled. This is useful in browsers where swiping triggers navigation actions. Swipe to open is disabled on iOS browsers by default.",
    "hysteresis": "Affects how far the drawer must be opened/closed to change its state. Specified as percent (0-1) of the width of the drawer",
    "minFlingVelocity": "Defines, from which (average) velocity on, the swipe is defined as complete although hysteresis isn&#39;t reached. Good threshold is between 250 - 1000 px/s",
    "onClose": "Callback fired when the component requests to be closed.<br><br><strong>Signature:</strong><br><code>function(event: object) =&gt; void</code><br><em>event:</em> The event source of the callback.",
    "onOpen": "Callback fired when the component requests to be opened.<br><br><strong>Signature:</strong><br><code>function(event: object) =&gt; void</code><br><em>event:</em> The event source of the callback.",
    "open": "Control the popup` open state.",
    "SwipeAreaProps": "The element is used to intercept the touch events on the edge.",
    "swipeAreaWidth": "The width of the left most (or right most) area in <code>px</code> that the drawer can be swiped open from.",
    "transitionDuration": "The duration for the transition, in milliseconds. You may specify a single timeout for all transitions, or individually with an object."
  },
  "classDescriptions": {}
}
