{
  "componentDescription": "",
  "propDescriptions": {
    "children": "O conteúdo do componente.",
    "columns": "The number of columns.",
    "columnSpacing": "Defines the horizontal space between the type <code>item</code> components. It overrides the value of the <code>spacing</code> prop.",
    "container": "If <code>true</code>, the component will have the flex <em>container</em> behavior. You should be wrapping <em>items</em> with a <em>container</em>.",
    "direction": "Defines the <code>flex-direction</code> style property. It is applied for all screen sizes.",
    "disableEqualOverflow": "If <code>true</code>, the negative margin and padding are apply only to the top and left sides of the grid.",
    "lg": "Defines the number of grids the component is going to use. It&#39;s applied for the <code>lg</code> breakpoint and wider screens if not overridden.",
    "lgOffset": "If a number, it sets the margin-left equals to the number of columns the grid item uses. If &#39;auto&#39;, the grid item push itself to the right-end of the container. The value is applied for the <code>lg</code> breakpoint and wider screens if not overridden.",
    "md": "Defines the number of grids the component is going to use. It&#39;s applied for the <code>md</code> breakpoint and wider screens if not overridden.",
    "mdOffset": "If a number, it sets the margin-left equals to the number of columns the grid item uses. If &#39;auto&#39;, the grid item push itself to the right-end of the container. The value is applied for the <code>md</code> breakpoint and wider screens if not overridden.",
    "rowSpacing": "Defines the vertical space between the type <code>item</code> components. It overrides the value of the <code>spacing</code> prop.",
    "sm": "Defines the number of grids the component is going to use. It&#39;s applied for the <code>sm</code> breakpoint and wider screens if not overridden.",
    "smOffset": "If a number, it sets the margin-left equals to the number of columns the grid item uses. If &#39;auto&#39;, the grid item push itself to the right-end of the container. The value is applied for the <code>sm</code> breakpoint and wider screens if not overridden.",
    "spacing": "Defines the space between the type <code>item</code> components. It can only be used on a type <code>container</code> component.",
    "wrap": "Defines the <code>flex-wrap</code> style property. It&#39;s applied for all screen sizes.",
    "xl": "Defines the number of grids the component is going to use. It&#39;s applied for the <code>xl</code> breakpoint and wider screens.",
    "xlOffset": "If a number, it sets the margin-left equals to the number of columns the grid item uses. If &#39;auto&#39;, the grid item push itself to the right-end of the container. The value is applied for the <code>xl</code> breakpoint and wider screens if not overridden.",
    "xs": "Defines the number of grids the component is going to use. It&#39;s applied for all the screen sizes with the lowest priority.",
    "xsOffset": "If a number, it sets the margin-left equals to the number of columns the grid item uses. If &#39;auto&#39;, the grid item push itself to the right-end of the container. The value is applied for the <code>xs</code> breakpoint and wider screens if not overridden."
  },
  "classDescriptions": {}
}
