{
  "componentDescription": "",
  "propDescriptions": {
    "autoHideDuration": "The number of milliseconds to wait before automatically calling the <code>onClose</code> function. <code>onClose</code> should then set the state of the <code>open</code> prop to hide the Snackbar. This behavior is disabled by default with the <code>null</code> value.",
    "component": "The component used for the root node. Either a string to use a HTML element or a component.",
    "disableWindowBlurListener": "If <code>true</code>, the <code>autoHideDuration</code> timer will expire even if the window is not focused.",
    "exited": "The prop used to handle exited transition and unmount the component.",
    "onClose": "Callback fired when the component requests to be closed. Typically <code>onClose</code> is used to set state in the parent component, which is used to control the <code>Snackbar</code> <code>open</code> prop. The <code>reason</code> parameter can optionally be used to control the response to <code>onClose</code>, for example ignoring <code>clickaway</code>.<br><br><strong>Signature:</strong><br><code>function(event: React.SyntheticEvent&lt;any&gt; | Event, reason: string) =&gt; void</code><br><em>event:</em> The event source of the callback.<br><em>reason:</em> Can be: <code>&quot;timeout&quot;</code> (<code>autoHideDuration</code> expired), <code>&quot;clickaway&quot;</code>, or <code>&quot;escapeKeyDown&quot;</code>.",
    "open": "If <code>true</code>, the component is shown.",
    "resumeHideDuration": "The number of milliseconds to wait before dismissing after user interaction. If <code>autoHideDuration</code> prop isn&#39;t specified, it does nothing. If <code>autoHideDuration</code> prop is specified but <code>resumeHideDuration</code> isn&#39;t, we default to <code>autoHideDuration / 2</code> ms.",
    "slotProps": "The props used for each slot inside the Snackbar.",
    "slots": "The components used for each slot inside the Snackbar. Either a string to use a HTML element or a component. See <a href=\"#slots\">Slots API</a> below for more details."
  },
  "classDescriptions": { "root": { "description": "Class name applied to the root element." } },
  "slotDescriptions": { "root": "The component that renders the root." }
}
