{
  "componentDescription": "",
  "propDescriptions": {
    "action": "A ref for imperative actions. It currently only supports <code>focusVisible()</code> action.",
    "color": "The color of the component. It supports those theme colors that make sense for this component.",
    "component": "The component used for the root node. Either a string to use a HTML element or a component.",
    "defaultValue": "The default selected value. Use when the component is not controlled.",
    "disabled": "If <code>true</code>, the component is disabled.",
    "endDecorator": "Trailing adornment for the select.",
    "getSerializedValue": "A function to convert the currently selected value to a string. Used to set a value of a hidden input associated with the select, so that the selected value can be posted with a form.",
    "indicator": "The indicator(*) for the select.    ________________   [ value        * ]    ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾",
    "onChange": "Callback fired when an option is selected.",
    "onClose": "Triggered when focus leaves the menu and the menu should close.",
    "placeholder": "Text to show when there is no selected value.",
    "renderValue": "Function that customizes the rendering of the selected value.",
    "size": "The size of the component.",
    "startDecorator": "Leading adornment for the select.",
    "sx": "The system prop that allows defining system overrides as well as additional CSS styles. See the <a href=\"/system/getting-started/the-sx-prop/\">`sx` page</a> for more details.",
    "value": "The selected value. Set to <code>null</code> to deselect all options.",
    "variant": "The variant to use."
  },
  "classDescriptions": {},
  "slotDescriptions": {
    "button": "The component used to render the button.",
    "endDecorator": "The component used to render the end decorator.",
    "indicator": "The component used to render the indicator.",
    "listbox": "The component used to render the listbox.",
    "root": "The component used to render the root.",
    "startDecorator": "The component used to render the start decorator."
  }
}
